app/controllers/articles_controller.rb

  def create
    @article = Article.create(article_params)
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "new article"], ["body", "does it redirect as expected?"], ["created_at", "2016-03-21 02:35:45.268627"], ["updated_at", "2016-03-21 02:35:45.268627"]]